export const gameGuide = {
    version: "V1.0",
    sections: [
        {
            title: "关于游戏：",
            content: ["重点模拟路亚钓鱼中面临的选择、突发事件，随机度高、有一定收集度，当前包含了n种鱼，n个场景，n种事件，和虚拟的boss鱼种。",
                "解锁后，在图鉴中可下载对应鱼类的创意图片。",
            ]
        },
        {
            title: "一些规则：",
            content: [
                "不同场景、不同钓点分布了不同的鱼类，鱼类有稀有度的区别，且同一种鱼有体型上的区别。",
                "中鱼后会根据时间对鱼造成被动伤害，同时还需完成鱼类反抗触发的QTE动作，才能成功钓起。",
                "当鱼的血量为0时被钓起，鱼线耐久耗尽鱼会脱钩。",
                "每次抛竿、搏鱼消耗总时间，时间结束本轮钓行结束。"]
        },
        {
            title: "关于事件：",
            content: ["事件包含基础\\附加天气事件、前\\后抛竿事件、Boss事件，游戏内的事件会影响中鱼率和稀有概率等元素，按照配置概率触发。"]
        },
        {
            title: "关于QTE：",
            content: ["选择正确QTE选项会增加伤害，反之会受到惩罚，惩罚和鱼的体型直接挂钩。不选择QTE鱼有直接逃脱的概率。"]
        },
        {
            title: "意见反馈：",
            content: ["可在作者的媒体账号中留言，感谢。"]
        }
    ]
};    